
__author__ = 'Dmitry Letyuk'



# Задача-1: Дано произвольное целое число, вывести самую большую цифру этого числа.
# Например, дается x = 58375.
# Нужно вывести максимальную цифру в данном числе, т.е. 8.
# Подразумевается, что мы не знаем это число заранее.
# Число приходит в виде целого беззнакового.
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании и понимании решите задачу с применением цикла for.

# раскладываем число как строку, по буквам
number = input('введите число:\n\t')
max_num = 0
num = [] # на всякий случай

for let in number:
    let = int(let)
    num.append(let) # как целые числа
    if let >= max_num:
        max_num = let
    #print(int(let)) # как целые числа
#print('максимальная цифра в числе:\n\t', sorted(num, reverse= True)[0])
print('максимальная цифра в числе:\n\t', sorted(num)[-1])
print(f'максимальная цифра в числе:\n\t {max_num}')

#
# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Решите задачу, используя только две переменные.
# Подсказки:
# * постарайтесь сделать решение через действия над числами;
# * при желании и понимании воспользуйтесь синтаксисом кортежей Python.

var_1 = int(input('Введите первое целое число:\n\t'))
var_2 = int(input('Введите второе целое число:\n\t'))
print( "initial:\n\t", var_1,",", var_2)
var_1, var_2 = var_2, var_1
print( "modified:\n\t", var_1,",", var_2)


# Задача-3: Напишите программу, вычисляющую корни квадратного уравнения вида
# ax² + bx + c = 0.
# Коэффициенты уравнения вводятся пользователем.
# Для вычисления квадратного корня воспользуйтесь функцией sqrt() модуля math:

import math
# math.sqrt(4) - вычисляет корень числа 4


print('ax² + bx + c = 0')
a = float(input('введите коэффициент "а" квадратного уравнения:\n\t'))
b = float(input('введите коэффициент "b" квадратного уравнения:\n\t'))
c = float(input('введите коэффициент "c" квадратного уравнения:\n\t'))

# дискриминант
D = b**2 - 4*a*c
print(f"дискриминант D = {D}")

if D < 0:
    print("действительных корней решнения уравнения нет")
elif D == 0:
    x = (-b) / (2 * a)
    print(f"корни уранения x1 = x2 = {x}")
else:
    x1 = ((-b) + math.sqrt(D))/(2*a)
    x2 = ((-b) - math.sqrt(D))/(2*a)
    print(f"корень х1= {x1}")
    print(f"корень х2= {x2}")

