
__author__ = 'Dmitry Letyuk'

# Задача-1: Дано произвольное целое число (число заранее неизвестно).
# Вывести поочередно цифры исходного числа (порядок вывода цифр неважен).
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании решите задачу с применением цикла for.

# код пишем тут...


# раскладываем число как строку, по буквам
number = input('ввдетие число:\n\t')
# num = [] # на всякий случай
for let in number:
#    num.append(int(let)) # как целые числа
    print(int(let)) # как целые числа
#print(num)



# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Подсказка:
# * постарайтесь сделать решение через дополнительную переменную
#   или через арифметические действия
# Не нужно решать задачу так:
# print("a = ", b, "b = ", a) - это неправильное решение!

var_1 = int(input('Введите первое целое число:\n\t'))
var_2 = int(input('Введите второе целое число:\n\t'))

print( "initial:\n\t", var_1,",", var_2)

var_3 = var_1
var_1 = var_2
var_2 = var_3

print( "modified:\n\t", var_1,",", var_2)


# print( "initial:\n\t", var_1,",", var_2)
# var_1, var_2 = var_2, var_1
# print( "modified:\n\t", var_1,",", var_2)


# Задача-3: Запросите у пользователя его возраст.
# Если ему есть 18 лет, выведите: "Доступ разрешен",
# иначе "Извините, пользование данным ресурсом только с 18 лет"

age = int(input('введите ваш возраст:\n\t'))

if age >= 18:
    print("Доступ разрешен")
else:
    print("Извините, пользование данным ресурсом только с 18 лет")
